## Production: quicksight
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 3 to add, 2 to change, 1 to destroy
```

<details>
<summary>Show summary</summary>

|  CHANGE  |                           NAME                            |
|----------|-----------------------------------------------------------|
| add      | `aws_cloudformation_stack.sms-usage-notifications`        |
|          | `aws_quicksight_refresh_schedule.sms-usage-notifications` |
| update   | `aws_quicksight_data_source.s3_sms_usage`                 |
|          | `aws_quicksight_refresh_schedule.sms_usage`               |
| recreate | `aws_s3_object.manifest_file`                             |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_cloudformation_stack.sms-usage-notifications will be created
  + resource "aws_cloudformation_stack" "sms-usage-notifications" {
      + id                = (known after apply)
      + name              = "sms-usage-notifications"
      + notification_arns = [
          + "arn:aws:sns:ca-central-1:296255494825:aws-controltower-SecurityNotifications",
        ]
      + outputs           = (known after apply)
      + parameters        = (known after apply)
      + policy_body       = (known after apply)
      + tags_all          = (known after apply)
      + template_body     = jsonencode(
            {
              + Resources = {
                  + smsusageJoined = {
                      + Properties = {
                          + AwsAccountId              = "296255494825"
                          + DataSetId                 = "sms-usage-notifications"
                          + DataSetUsageConfiguration = {
                              + DisableUseAsDirectQuerySource = false
                              + DisableUseAsImportedSource    = false
                            }
                          + ImportMode                = "SPICE"
                          + LogicalTableMap           = {
                              + notifications           = {
                                  + Alias  = "notifications"
                                  + Source = {
                                      + DataSetArn = "arn:aws:quicksight:ca-central-1:296255494825:dataset/notifications"
                                    }
                                }
                              + sms-usage               = {
                                  + Alias  = "sms-usage"
                                  + Source = {
                                      + DataSetArn = "arn:aws:quicksight:ca-central-1:296255494825:dataset/sms_usage"
                                    }
                                }
                              + sms-usage-notifications = {
                                  + Alias  = "sms-usage-notifications"
                                  + Source = {
                                      + JoinInstruction = {
                                          + LeftOperand  = "sms-usage"
                                          + OnClause     = "{MessageId} = {notification_reference}"
                                          + RightOperand = "notifications"
                                          + Type         = "LEFT"
                                        }
                                    }
                                }
                            }
                          + Name                      = "Notifications with SMS pricing"
                          + Permissions               = [
                              + {
                                  + Actions   = [
                                      + "quicksight:DescribeDataSet",
                                      + "quicksight:DescribeDataSetPermissions",
                                      + "quicksight:DescribeIngestion",
                                      + "quicksight:ListIngestions",
                                      + "quicksight:PassDataSet",
                                    ]
                                  + Principal = "arn:aws:quicksight:ca-central-1:296255494825:group/default/quicksight-dataset-viewers"
                                },
                              + {
                                  + Actions   = [
                                      + "quicksight:DescribeDataSet",
                                      + "quicksight:DescribeDataSetPermissions",
                                      + "quicksight:DescribeIngestion",
                                      + "quicksight:ListIngestions",
                                      + "quicksight:PassDataSet",
                                      + "quicksight:DeleteDataSet",
                                      + "quicksight:UpdateDataSet",
                                      + "quicksight:UpdateDataSetPermissions",
                                      + "quicksight:CreateIngestion",
                                      + "quicksight:CancelIngestion",
                                    ]
                                  + Principal = "arn:aws:quicksight:ca-central-1:296255494825:group/default/quicksight-dataset-owners"
                                },
                            ]
                        }
                      + Type       = "AWS::QuickSight::DataSet"
                    }
                }
            }
        )
    }

  # aws_quicksight_data_source.s3_sms_usage will be updated in-place
  ~ resource "aws_quicksight_data_source" "s3_sms_usage" {
        id             = "296255494825/s3-sms-usage"
        name           = "SMS Usage Data Source"
        tags           = {}
        # (5 unchanged attributes hidden)

      ~ parameters {
          ~ s3 {
              ~ manifest_file_location {
                  ~ key    = "quicksight/s3-manifest-sms-usage.json" -> "quicksight/s3-manifest-sms-usage-production.json"
                    # (1 unchanged attribute hidden)
                }
            }
        }
    }

  # aws_quicksight_refresh_schedule.sms-usage-notifications will be created
  + resource "aws_quicksight_refresh_schedule" "sms-usage-notifications" {
      + arn            = (known after apply)
      + aws_account_id = (known after apply)
      + data_set_id    = "sms-usage-notifications"
      + id             = (known after apply)
      + schedule_id    = "schedule-sms-usage-notifications"

      + schedule {
          + refresh_type          = "FULL_REFRESH"
          + start_after_date_time = (known after apply)

          + schedule_frequency {
              + interval        = "DAILY"
              + time_of_the_day = "07:45"
              + timezone        = (known after apply)
            }
        }
    }

  # aws_quicksight_refresh_schedule.sms_usage will be updated in-place
  ~ resource "aws_quicksight_refresh_schedule" "sms_usage" {
        id             = "296255494825,sms_usage,schedule-sms-usage"
        # (4 unchanged attributes hidden)

      ~ schedule {
          ~ start_after_date_time = "2024-03-21T02:51:11" -> (known after apply)
            # (1 unchanged attribute hidden)

          ~ schedule_frequency {
              ~ time_of_the_day = "02:30" -> "05:00"
              ~ timezone        = "UTC" -> (known after apply)
                # (1 unchanged attribute hidden)
            }
        }
    }

  # aws_s3_object.manifest_file must be replaced
-/+ resource "aws_s3_object" "manifest_file" {
      ~ arn                    = "arn:aws:s3:::notification-canada-ca-production-sms-usage-logs/quicksight/s3-manifest-sms-usage.json" -> (known after apply)
      ~ bucket_key_enabled     = false -> (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      ~ content_type           = "application/octet-stream" -> (known after apply)
      ~ etag                   = "a687d10ac9082c405f228ac19bdbe91d" -> "1590a8fc5c5e30ba9537c42cb49cb43f"
      ~ id                     = "quicksight/s3-manifest-sms-usage.json" -> (known after apply)
      ~ key                    = "quicksight/s3-manifest-sms-usage.json" -> "quicksight/s3-manifest-sms-usage-production.json" # forces replacement
      + kms_key_id             = (known after apply)
      - metadata               = {} -> null
      ~ server_side_encryption = "AES256" -> (known after apply)
      ~ source                 = "./s3-manifests/s3-manifest-sms-usage.json" -> "./s3-manifests/s3-manifest-sms-usage-production.json"
      ~ storage_class          = "STANDARD" -> (known after apply)
      - tags                   = {} -> null
      ~ tags_all               = {} -> (known after apply)
      + version_id             = (known after apply)
        # (3 unchanged attributes hidden)
    }

Plan: 3 to add, 2 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_cloudformation_stack.sms-usage-notifications"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.quicksight-rds"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.quicksight-s3-usage"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.quicksight_vpc_connection_ec2"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.quicksight_vpc_connection_iam"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.quicksight"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.vpc_connection_role"]
WARN - plan.json - main - Missing Common Tags: ["aws_quicksight_data_set.jobs"]
WARN - plan.json - main - Missing Common Tags: ["aws_quicksight_data_set.login_events"]
WARN - plan.json - main - Missing Common Tags: ["aws_quicksight_data_set.notifications"]
WARN - plan.json - main - Missing Common Tags: ["aws_quicksight_data_set.organisation"]
WARN - plan.json - main - Missing Common Tags: ["aws_quicksight_data_set.services"]
WARN - plan.json - main - Missing Common Tags: ["aws_quicksight_data_set.sms_usage"]
WARN - plan.json - main - Missing Common Tags: ["aws_quicksight_data_set.templates"]
WARN - plan.json - main - Missing Common Tags: ["aws_quicksight_data_set.users"]
WARN - plan.json - main - Missing Common Tags: ["aws_quicksight_data_source.rds"]
WARN - plan.json - main - Missing Common Tags: ["aws_quicksight_data_source.s3_sms_usage"]
WARN - plan.json - main - Missing Common Tags: ["aws_quicksight_vpc_connection.rds"]
WARN - plan.json - main - Missing Common Tags: ["aws_s3_object.manifest_file"]

38 tests, 19 passed, 19 warnings, 0 failures, 0 exceptions

```

</details>
